## Opening a local csv file

In [15]:
import pandas as pd
df = pd.read_csv('aug_train.csv')
df.sample(2)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
5748,1012,city_114,0.926,Male,Has relevent experience,Part time course,Masters,STEM,16,50-99,NGO,3,58,0.0
3584,31754,city_16,0.910,Other,Has relevent experience,no_enrollment,Masters,STEM,9,50-99,Pvt Ltd,1,33,0.0

## Opening a csv file from an URL

In [14]:
# Code 1
import requests
from io import StringIO

url = "https://raw.githubusercontent.com/CourseMaterial/DataWrangling/main/flowerdataset.csv"
headers = {"User-Agent": "Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:66.0) Gecko/20100101 Firefox/66.0"}
req = requests.get(url, headers=headers)
data = StringIO(req.text)
df = pd.read_csv(data)
df.sample(2)

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
132           6.4          2.8           5.6          2.2  Iris-virginica

In [13]:
# Code 2
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/CourseMaterial/DataWrangling/main/flowerdataset.csv')
df.sample(2)

     sepal_length  sepal_width  petal_length  petal_width          species
144           6.7          3.3           5.7          2.5   Iris-virginica
90            5.5          2.6           4.4          1.2  Iris-versicolor

## Sep parameter for reading tsv files

In [16]:
df = pd.read_csv("movie_titles_metadata.tsv")
df.sample(2)

    m0\t10 things i hate about you\t1999\t6.90\t62847\t['comedy' 'romance']
495  m496\trush hour 2\t2001\t6.50\t52716\t['action...
467  m468\tpearl harbor\t2001\t5.40\t97519\t['actio...

In [12]:
df = pd.read_csv("movie_titles_metadata.tsv", sep='\t')
df.sample(2)

,m0,10 things i hate about you,1999,6.90,62847,['comedy' 'romance']
75,m76,gladiator,2000,8.4,286067.0,['action' 'adventure' 'drama']
478,m479,pretty woman,1990,6.7,61642.0,['comedy' 'romance']

In [17]:
# The given dataset has no column names, these col names can be assgined, by using the names parameter
df = pd.read_csv("movie_titles_metadata.tsv", sep='\t', names=['sno', 'name', 'release_year', 'rating', 'votes', 'genres'])
df.sample(2)

,sno,name,release_year,rating,votes,genres
35,m35,blast from the past,1999,6.4,23489.0,['comedy' 'drama' 'romance']
517,m517,sleepy hollow,1999,7.5,108951.0,['fantasy' 'mystery' 'thriller']

## Index_col parameter

In [19]:
df = pd.read_csv('aug_train.csv')
df.sample(2)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
13518,29416,city_103,0.92,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Pvt Ltd,1,28,0.0
7393,12659,city_103,0.92,NaN,Has relevent experience,no_enrollment,Graduate,STEM,>20,1000-4999,Public Sector,>4,9,0.0

In [18]:
# Reset default pandas index parameter with enrollee_id
df = pd.read_csv('aug_train.csv', index_col='enrollee_id')
df.sample(2)

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
enrollee_id,,,,,,,,,,,,,
11753,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,Arts,5,NaN,NaN,never,101,0.0
26049,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,1,NaN,NaN,never,176,1.0

## Header parameter

In [20]:
df = pd.read_csv('test.csv')
df.head(2)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
1,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0

In [21]:
# In the above dataset, the col names are considered as data, this can be solve by using the header parameter
df = pd.read_csv('test.csv', header=1)
df.head(2)

,0,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
1,2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0

## use_cols parameter

In [23]:
# Used to extract only specifed columns from the dataset
df = pd.read_csv('aug_train.csv', usecols=['enrollee_id', 'gender'])
df.sample(2)

       enrollee_id gender
13942        16558    NaN
8425         26678   Male

## Squeeze parameter

In [26]:
df = pd.read_csv('aug_train.csv', usecols=['gender'])
df.sample(2)

      gender
18631   Male
3991    Male

In [25]:
# Is used to convert a single column from a pandas dataframe to pandas series
df = pd.read_csv('aug_train.csv', usecols=['gender'], squeeze=True)
df.sample(2)

18268    Male
17872    Male
Name: gender, dtype: object

## skiprows/nrows parameter

In [27]:
df = pd.read_csv('aug_train.csv')
df.head(4)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0

In [30]:
# skiprows is used to skip particular rows
df = pd.read_csv('aug_train.csv', skiprows=[1,3])
df.head(4) # rows with enrollee_id 8949 and 11561 skipped

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
1,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
2,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
3,21651,city_176,0.764,NaN,Has relevent experience,Part time course,Graduate,STEM,11,NaN,NaN,1,24,1.0

In [31]:
# nrows is used to import rows of particular quantity
df = pd.read_csv('aug_train.csv', nrows=3)
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0

## Encoding parameter

In [45]:
df = pd.read_csv('zomato.csv')
df.iloc[9546]

Restaurant ID                                                     5915730
Restaurant Name                                               Naml Gurme
Country Code                                                          208
City                                                            stanbul
Address                 Kemanke Karamustafa Paa Mahallesi, Rhtm ...
Locality                                                         Karak_y
Locality Verbose                                      Karak_y, stanbul
Longitude                                                       28.977392
Latitude                                                        41.022793
Cuisines                                                          Turkish
Average Cost for two                                                   80
Currency                                                 Turkish Lira(TL)
Has Table booking                                                      No
Has Online delivery                                                    No
Is delivering now                                                      No
Switch to order menu                                                   No
Price range                                                             3
Aggregate rating                                                      4.1
Rating color                                                        Green
Rating text                                                     Very Good
Votes                                                                 788
Name: 9546, dtype: object

In [46]:
# encoding parameter can be used to load datasets of different encoding other than utf-8
df = pd.read_csv('zomato.csv', encoding='latin-1')
df.iloc[9546]

Restaurant ID                                                     5915730
Restaurant Name                                              Naml Gurme
Country Code                                                          208
City                                                            stanbul
Address                 Kemanke Karamustafa Paa Mahallesi, Rht...
Locality                                                         Karak_y
Locality Verbose                                      Karak_y, stanbul
Longitude                                                       28.977392
Latitude                                                        41.022793
Cuisines                                                          Turkish
Average Cost for two                                                   80
Currency                                                 Turkish Lira(TL)
Has Table booking                                                      No
Has Online delivery                                                    No
Is delivering now                                                      No
Switch to order menu                                                   No
Price range                                                             3
Aggregate rating                                                      4.1
Rating color                                                        Green
Rating text                                                     Very Good
Votes                                                                 788
Name: 9546, dtype: object

## Skip bad lines

In [51]:
# This parameter is used to skip lines that cause parser error
df = pd.read_csv('BX-Books.csv', encoding='latin-1', error_bad_lines=False)
df.head(2)

C:\Users\Amruta\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

## dtypes parameter

In [53]:
pd.read_csv('aug_train.csv').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

In [54]:
# Convert datatype of target from float to int
pd.read_csv('aug_train.csv', dtype={'target':int}).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  int32
dtypes: float64(1), int32(1), int64(2), object(10)
memory usage: 2.0+ MB

## Handling Dates

In [55]:
pd.read_csv('IPL Matches 2008-2020.csv').info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               816 non-null    int64
 1   city             803 non-null    object
 2   date             816 non-null    object
 3   player_of_match  812 non-null    object
 4   venue            816 non-null    object
 5   neutral_venue    816 non-null    int64
 6   team1            816 non-null    object
 7   team2            816 non-null    object
 8   toss_winner      816 non-null    object
 9   toss_decision    816 non-null    object
 10  winner           812 non-null    object
 11  result           812 non-null    object
 12  result_margin    799 non-null    float64
 13  eliminator       812 non-null    object
 14  method           19 non-null     object
 15  umpire1          816 non-null    object
 16  umpire2          816 non-null    object
dtypes: float64(1), int64(2), object(14)
memory usage: 108.5+ KB

In [56]:
# Convert the date attribute into datetime
pd.read_csv('IPL Matches 2008-2020.csv', parse_dates=['date']).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 816 entries, 0 to 815
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               816 non-null    int64
 1   city             803 non-null    object
 2   date             816 non-null    datetime64[ns]
 3   player_of_match  812 non-null    object
 4   venue            816 non-null    object
 5   neutral_venue    816 non-null    int64
 6   team1            816 non-null    object
 7   team2            816 non-null    object
 8   toss_winner      816 non-null    object
 9   toss_decision    816 non-null    object
 10  winner           812 non-null    object
 11  result           812 non-null    object
 12  result_margin    799 non-null    float64
 13  eliminator       812 non-null    object
 14  method           19 non-null     object
 15  umpire1          816 non-null    object
 16  umpire2          816 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(2), object(13)
memory usage: 108.5+ KB

## Converters

In [58]:
pd.read_csv('IPL Matches 2008-2020.csv').head(1)

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,335982,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,Royal Challengers Bangalore,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,NaN,Asad Rauf,RE Koertzen

In [59]:
# Converters is used to apply a operation on a particular column

def rename(name):
    if name == "Royal Challengers Bangalore":
        return "RCB"
    else:
        return name

pd.read_csv('IPL Matches 2008-2020.csv', converters={'team1':rename}).head(1)

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,335982,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,RCB,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,NaN,Asad Rauf,RE Koertzen

## na_values parameter

In [61]:
# Consider values with specified attribute as NaN
pd.read_csv('aug_train.csv', na_values=['Male']).head(2)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,NaN,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0

## Loading a huge dataset in chunks

In [63]:
dfs = pd.read_csv('aug_train.csv', chunksize=5000)
dfs

In [65]:
for chunks in dfs:
    print(chunks.shape)

(5000, 14)
(5000, 14)
(4158, 14)